//
//  Data.swift
//  amazon
//
//  Created by Macbook on 11/03/1443 AH.
//

import UIKit



struct Iitem {
    let namee : String
    let date : String
    let imageee : UIImage?
    let summmmer : String
}

var qaz : Array<Iitem> = []
var wsx : Array<Iitem> = []
var edc : Array<Iitem> = []


var Liist : Array<Iitem> = [
    Iitem(
        namee: "apple airpods 2",
        date : "699",
        imageee: UIImage(named: "111111_3570"),
        summmmer : "ميكروفون مزدوج بتكنولوجيا التكوين الشعاعي، مستشعرات بصرية مزدوجة، مقياس تسارع يتعرف على الحركة، مقياس تسارع يتعرف على الكلام"
    ),
Iitem(
    namee: "apple airpods pro",
    date : "899",
    imageee: UIImage(named: "111111_3570"),
    summmmer : "ميكروفون مزدوج بتكنولوجيا التكوين الشعاعي,مكيروفون باتجاه الأذن,مستشعر بصري مزدوج,مقياس تسارع يتعرف على الحركة,مقياس تسارع يتعرف على الكلام,مستشعر ضغط"
),
Iitem(
    namee: "iphone 12 pro",
    date : "3999",
    imageee: UIImage(named: "111111_3570"),
    summmmer : "نظام كاميرا مزدوجة 12MP (كاميرا واسعة للغاية وكاميرا واسعة) مع نمط بورتريه‏، ونمط الليل، وDeep Fusion‏، وميزة ‏HDR 3 الذكية وتسجيل فيديو HDR مع Dolby Vision لغاية 4K بمعدل 30 إطاراً في,الثانية، وفيديو 4K لغاية 60 إطاراً في الثانية بنطاق ديناميكي أوسع"
),
Iitem(
    namee: "apple watch",
    date : "1499",
    imageee: UIImage(named: "111111_3570"),
    summmmer : "شاشة Retina لا تنطفئ أكبر من شاشة Series 6 بنسبة 20% تقريباً، ما يتيح لك المزيد من السهولة في الرؤية والاستخدام"

),
Iitem(
    namee: "console PS5",
    date : "250",
    imageee: UIImage(named: "111111_3570"),
    summmmer : "اكتشف تجربة لعب أعمق وغامرة للغاية مع وحدة تحكم PlayStation 5 المبتكرة الجديدة والتي تتميز باستجابة لمسية وتأثيرات تحفيز ديناميكية تتضمن وحدة التحكم دوال سينس اللاسلكية ميكروفون مدمج وزر إنشائي، وجميعها مدمجة في تصميم أيقوني ومريح."

),
Iitem(
    namee: "PS5",
    date : "2999",
    imageee: UIImage(named: "111111_3570"),
    
    summmmer : "استمتع بتجربة تحميل بسرعة البرق مع وسيط تخزين ذو حالة ثابتة فائق السرعة، وانغماس أعمق مع دعمٍ لردود الفعل اللمسية، وأزرار متكيفة وصوت ثلاثي الأبعاد، وجيل جديد تمامًا من ألعاب PlayStation المذهلة"

),
Iitem(
    namee: "coffe maker",
    date : "500",
    imageee: UIImage(named: "15"),
    summmmer : "ديلونجي EC9 الة لصنع القهوة كما لو ان تم صنعها في المقهى. ابعاد هذه الالة تصل الى 24.0 * 26.0 * 29.0سم ويمكن وضعها في مطبخ ضيق. وهي تزن فقط 2.5 كغم مما يسهل عملية نقلها من مكان لاخر. الة صنع القهوة هذه تتميز بنظام فاريو الذي يوفرلك امكانية اختيار من النكهة الغنية الى الخفيفية. وهذه الميزة توفر لك السيطرة بالكامل على طعم المشروب الخاص بك اذ تتيح لك صنع القهوة بالطريقة التي ترغبها."

),
Iitem(
    namee: "coffe maker",
    date : "400",
    imageee: UIImage(named: "16"),
    summmmer : "سعة خزان المياه: 0.8 لتر، وزن الماكينة: 2.5 كغم، القوة الكهربائية للآلة: 1500 واط، ستستمتع بقهوةٍ مصنوعة باحتراف بالكريما المخملية الكثيفة، مع نظام الضغط الذي يقدر بنحو 15 بار لماكينة القهوة ميني مي. يتم الحفاظ على جودة القهوة باستخدام كبسولات محكمة الإغلاق للاستمتاع بمذاق غني ورائحة فواحة. اختر ما تريد تناوله من مشروبات القهوة الـ 16: إذ يمكنك التمتع بمجموعةٍ واسعة من الاسبريسو والكابتشينو بالرغوة الناعمة أو قهوة غراندي ذات الرائحة الأخاذة وحتى مشروب الشوكولاتة الساخنة ونكهات الشاي المتنوعة وأكثر من ذلك تحضّر ماكينة تحضير القهوة ميني مي المشروبات الساخنة بالإضافة إلى المشروبات الباردة اللذيذة باستخدام الكبسولات. يقوم وضع الشحن الاقتصادي بإيقاف تشغيل الجهاز تلقائيًا بعد 5 دقائق من عدم الاستخدام. يملك الجهاز تصنيف ايه في مجال استهلاك الطاقة."

),
]


