Repository: MohammedAlbahal/Tuwaiq1000App-FinalProject
Catalog: tuwaiq 1000/tuwaiq 1000/*.lproj/Localizable.strings
Languages: ar

# q
source: Conditions for applying to Tuwaiq camp 1000
ar: شروط التسجيل في معسكر طويق ١٠٠٠

# w
source: The applicant for the camp should be a Saudi or a Saudi national, possesses passion and interest in any of the technical tracks in the program, has real and convincing motives to join, possesses distinct and excellent skills in teamwork with others, the applicant must be at least 18 years old, full proficiency by the applicant English, passing the applicant’s personal interview, full-time for the applicant for a period of no less than 4 months, the participant shall pay all program expenses in case of unjustified withdrawal or absence
ar: أن يكون المتقدم للمخيم سعودي الجنسية أو سعودي الجنسية ، ولديه شغف واهتمام بأي من المسارات الفنية في البرنامج ، ولديه دوافع حقيقية ومقنعة للانضمام ، ولديه مهارات مميزة وممتازة في العمل الجماعي مع الآخرين ، ويجب على المتقدم. أن يكون عمرك 18 عامًا على الأقل ، إجادة كاملة من قبل المتقدم للغة الإنجليزية ، اجتياز المقابلة الشخصية لمقدم الطلب ، بدوام كامل لمقدم الطلب لمدة لا تقل عن 4 أشهر ، يجب على المشارك دفع جميع نفقات البرنامج في حالة الانسحاب أو الغياب غير المبرر

# e
source: Training a thousand Saudi female developers on advanced technical skills
ar: تدريب ألف مطورة سعودية على المهارات التقنية المتقدمة

# r
source: Collaborating with Tuwaiq Academy to train 1,000 Saudi developers, As part of our ongoing commitment to help people and businesses grow, we're happy to collaborate with Tuwaiq Academy to equip a thousand Saudi developers with advanced tech skills to successfully scale their ideas. The initiative 'Tuwaiq 1000' was announced last week in Riyadh, which also included a series of local initiatives to boost tech innovation across the Kingdom in collaboration with a number of companies
ar: بالتعاون مع أكاديمية طويق لتدريب 1000 مطور سعودي ، كجزء من التزامنا المستمر بمساعدة الأفراد والشركات على النمو ، يسعدنا التعاون مع أكاديمية طويق لتزويد ألف مطور سعودي بمهارات تقنية متقدمة لتوسيع نطاق أفكارهم بنجاح. تم الإعلان عن مبادرة طويق ١٠٠٠ الأسبوع الماضي في الرياض ، والتي تضمنت أيضًا سلسلة من المبادرات المحلية لتعزيز الابتكار التكنولوجي في جميع أنحاء المملكة بالتعاون مع عدد من الشركات

# t
source: Tuwaiq Software Path
ar: مسار البرمجة لطويق

# y
source: Tuwaiq Software Path: It is a training camp that aims to qualify Saudi capabilities to become programmers using the latest programming languages ​​to give them sufficient technical and practical experience to start their careers in the specialties of developing web and mobile applications. Tuwaiq Software Path: A training camp that aims to qualify Saudi capabilities to become programmers using the latest languages Programming to give them enough technical and practical experience to start their careers in web and mobile application development
ar: مسار طويق البرمجي: هو معسكر تدريبي يهدف إلى تأهيل القدرات السعودية ليصبحوا مبرمجين يستخدمون أحدث لغات البرمجة لمنحهم الخبرة الفنية والعملية الكافية لبدء حياتهم المهنية في تخصصات تطوير تطبيقات الويب والجوال. مسار طويق البرمجي: معسكر تدريبي يهدف إلى تأهيل القدرات السعودية ليصبحوا مبرمجين يستخدمون أحدث اللغات في البرمجة لمنحهم الخبرة التقنية والعملية الكافية لبدء حياتهم المهنية في تطوير تطبيقات الويب والهاتف المحمول

# u
source: At Hack
ar: في الاختراق

# i
source: Riyadh Season has announced the launch of the At Hack event, the largest cybersecurity event in the Middle East, which will take place from 28-30 November, in the “Riyadh Front” area, which is the most rich and attractive for quality events of interest to visitors of all ages. The zone connects global investors and manufacturers with those interested from the Kingdom and its visitors from abroad, and brings together the greatest minds, elite professionals and trainers globally in this field for the first time in the Kingdom
ar: أعلن موسم الرياض عن إطلاق حدث At Hack ، أكبر حدث للأمن السيبراني في الشرق الأوسط ، والذي سيعقد في الفترة من 28 إلى 30 نوفمبر ، في منطقة واجهة الرياض ، وهي الأكثر ثراءً وجاذبية للأحداث عالية الجودة. تهم الزوار من جميع الأعمار. تربط المنطقة المستثمرين والمصنعين العالميين بالمهتمين من المملكة وزوارها من الخارج ، وتجمع أفضل العقول ونخبة المهنيين والمدربين على مستوى العالم في هذا المجال لأول مرة في المملكة.

# o
source: tuwaiq bootcamp
ar: معسكرات طويق

# p
source: Together with experts from inside and outside Google, we'll kick-off a series of workshops in December to help participants learn how to solve real-life problems using machine learning and Google Cloud Platform. The workshops will be conducted at established centers by Tuwaiq Academy in different parts of the Kingdom, in addition to others being hosted online,If you're in Saudi Arabia and interested in joining the program, please visit the website and apply for the 'Tuwaiq 1000' bootcamp
ar: بالتعاون مع خبراء من داخل وخارج Google ، سنبدأ سلسلة من ورش العمل في ديسمبر لمساعدة المشاركين على تعلم كيفية حل مشكلات الحياة الواقعية باستخدام التعلم الآلي و Google Cloud Platform. ستُقام ورش العمل في المراكز التي أنشأتها أكاديمية طويق في أنحاء مختلفة من المملكة ، بالإضافة إلى ورش العمل الأخرى التي يتم استضافتها عبر الإنترنت ، إذا كنت في المملكة العربية السعودية ومهتم بالانضمام إلى البرنامج ، يرجى زيارة الموقع الإلكتروني والتقدم بطلب للحصول على برنامج طويق 1000 مخيم تدريبي

# a
source: Website DNS Tuwaiq 1000
ar: موقع طويق ١٠٠٠

# s
source: Tuwaiq camp test 1000 | cyber security track Tuesday 7 September 2021 from 10 am to 4 pm
ar: اختبار مخيم طويق 1000 | مسار الأمن السيبراني الثلاثاء 7 سبتمبر 2021 من الساعة 10 صباحًا حتى 4 مساءً

# d
source: Tuwaiq Programming Bootcamp
ar: معسكر طويق للبرمجة

# f
source: The Tuwaiq Programming embraces beginners through nurturing and training them from scratch, giving professionals an opportunity to reﬁne their programming skills, and opening doors to those who are interested in learning new skills, building websites or designing applications for their startup business ideas. The camp prepares trainees for the job market, provides personal support and direct guidance, and focuses on required skills through a multi-project-based education, creating continuous challenges that showcases exceptional abilities and contribute to unique digital career opportunities. Official website: satr.codes
ar: تحتضن برمجة طويق المبتدئين من خلال رعايتهم وتدريبهم من الصفر ، وإعطاء المحترفين فرصة لإعادة تطوير مهاراتهم في البرمجة ، وفتح الأبواب لأولئك المهتمين بتعلم مهارات جديدة ، أو بناء مواقع إلكترونية أو تصميم تطبيقات لأفكارهم التجارية الناشئة. يقوم المخيم بإعداد المتدربين لسوق العمل ، ويقدم الدعم الشخصي والتوجيه المباشر ، ويركز على المهارات المطلوبة من خلال التعليم القائم على عدة مشاريع ، مما يخلق تحديات مستمرة تعرض قدرات استثنائية وتساهم في فرص وظيفية رقمية فريدة. الموقع الرسمي: satr.codes

# g
source: 1000 young men and women
ar: ١٠٠٠ شاب و شابة

# h
source: Provides #Twaiq_1000_camp ending with employment Various training tracks in the fields of technology for 1000 male and female students to rise up in the Kingdom globally in the technology industry 🇸🇦
ar: يوفر مخيم #طويق_1000_منتهي بالتوظيف مسارات تدريبية متنوعة في مجالات التكنولوجيا لـ 1000 طالب وطالبة لينهضوا في المملكة عالمياً في صناعة التكنولوجيا

# j
source: javascript Bootcamp
ar: معسكر جافا سكريبت

# k
source: The Saudi Federation for Cyber ​​Security, Programming and Drones has announced the opening of the largest attendance training camp in the world, which ends with the recruitment of participants. The camp aims to train approximately 1,000 young men and women in many regions of the Kingdom at the same time, in coordination with the Ministry of Communications and Information Technology for investment The energies of the emerging Saudi youth and their refinement through intensive training to develop programming skills through simple platforms, to then move to advanced and advanced levels, and enhance trainees' awareness of modern technologies
ar: أعلن الاتحاد السعودي للأمن السيبراني والبرمجة والطائرات بدون طيار عن افتتاح أكبر معسكر تدريبي للحضور في العالم والذي ينتهي باستقطاب المشاركين. يهدف المخيم إلى تدريب ما يقرب من 1000 شاب وشابة في العديد من مناطق المملكة في نفس الوقت بالتنسيق مع وزارة الاتصالات وتكنولوجيا المعلومات لاستثمار طاقات الشباب السعودي الناشئة وصقلها من خلال التدريب المكثف لتطوير البرمجة. من خلال منصات بسيطة ، للانتقال بعد ذلك إلى المستويات المتقدمة والمتقدمة ، وتعزيز وعي المتدربين بالتقنيات الحديثة

# l
source: Tuwaiq Academy Student, Staff or Employee? Click Here to Login
ar: طالب أو موظف في أكاديمية طويق؟ انقر هنا لتسجيل الدخول

# z
source: Student
ar: طالب

# x
source: Instroctor
ar: مدرب

# c
source: Click Here to Login
ar: اضغط لتسجيل الدخول

source: Change to Arabic
ar: غير اللغة الى الانجليزية

source: Continue with Google
ar: سجل دخولك مع قوقل

# m
source: Tuwaiq 1000
ar: طويق ١٠٠٠
