//  tuwaiq 1000
//
//  Created by M.Al-qhtani on 07/05/1443 AH.
//

import Foundation
import UIKit

//--------------------------------------------------------------------------
struct Court_str {
  
  let image: UIImage?
  let name: String
  let a: Array <A>
}
//--------------------------------------------------------------------------
struct A{
  let imageA: UIImage?
  let nameA: String
  let staly: String
  let summaryA: String
}
//--------------------------------------------------------------------------
var data_Court_str = [
  
  Court_str(
    image: UIImage(named: "WEEK2"),
    name: "",
    
    a: [A(
      imageA: UIImage(named: "WEEK2"),
      nameA: "اصدار الصكوك",
      staly: "",
      summaryA: "h"
    ),
        
        A(
          imageA: UIImage(named: "WEEK2"),
          nameA: "المنازعه في الملكيه",
          staly: "",
          summaryA: "k"
        )]
  ),
  //==========================================================================
  Court_str(
    image: UIImage(named: "WEEK2"),
    name:"",
    
    a: [A(
      imageA: UIImage(named: "WEEK2"),
      nameA: "الاستعلام التفصيلي عن قضية",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "WEEK2"),
          nameA: "الاطلاع على الأحكام",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "الاستعلام عن مواعيد الجلسات",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "الاستعلام عن حالة قضية",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "قضاياي",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "مواعيدي",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
       ]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "ad4"),
    name: "محكمه الاحوال الشخصيه",
    
    a: [A(
      imageA: UIImage(named: "ad4"),
      nameA: "إثبات الزواج",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "إثبات الطلاق والخلع",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        A(
          imageA: UIImage(named: "ad4"),
          nameA: "الحضانه والنفقه و الزياره",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "إثتبات الوقف والوصيه",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "إثبات النسب",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "الميراث وقسمه التركه",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "إثبات تعيين الاوصياء",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "إثبات الغيبه والوفاه و حصر الورثه",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "الحجر على السفهاء",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "تزويج من لا ولي لها",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "إثبات توكيل الأخرس",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
       ]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "المحكمه التجاريه",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "المنازعات التجاريه",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "الدعوى على تاجر",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "دعاوى الإفلاس",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "مخالفات الانظمه التجاريه",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "دعوى على مقاول إنشائي",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "دعوى  بالتوريد",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "دعوى المتعلقه بالسمسره",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "النزاعات في تركت المتوفي",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
       ]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "المحكمه العماليه",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "عقود العمل و الاجور",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "عقوبات نظام العمل",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "الفصل من العمل",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "اعتراض على قرار",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "التظلم",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        ),
       ]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "منصة تراضي",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        )]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "خدمة التقاضي الإلكتروني",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        )]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "التحقق من صحة وثائق الصلح",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        )]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "صحيفة الدعوى الإلكترونية",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        )]
  ),
  
  //==========================================================================
  Court_str(
    image: UIImage(named: "law3.png"),
    name: "طلب التنفيذ الإلكتروني",
    
    a: [A(
      imageA: UIImage(named: "law4.png"),
      nameA: "",
      staly: "",
      summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
    ),
        
        A(
          imageA: UIImage(named: "law4.png"),
          nameA: "",
          staly: "",
          summaryA: """
وصف الخدمه ......



متطلبات الخدمه .......



خطوات التقديم على الخدمه .......
"""
        )]
  ),
  
  //==========================================================================
]
